000_РОЗНИЦА_ЦЕНТР/src/Catalogs/УслугиБанка/УслугиБанка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УслугиБанка</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>МгновеннаяРассрочка</name>
      <description>Мгновенная рассрочка</description>
    </items>
  </predefined>
  <attributes>
    <name>Банк</name>
    <type>
      <types>CatalogRef.КлассификаторБанков</types>
    </type>
  </attributes>
  <attributes>
    <name>Блокирован</name>
    <comment>Услуга заблокирована</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПрограммы</name>
    <comment>Банковский идентификатор кредитования</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСкидкиНаценки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомиссияБанка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодПредоставления</name>
    <comment>Период, например, рассрочки платежа - в платежах (например 6 платежей)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипУслуги</name>
    <type>
      <types>EnumRef.ТипыУслугБанка</types>
    </type>
  </attributes>
  <attributes>
    <name>Эквайрер</name>
    <comment>Эквайрер по умолчанию</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НоменклатураИсключения</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.СегментыНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НоменклатураПредоставления</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>CatalogRef.СегментыНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ТипыУслугБанка/ТипыУслугБанка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыУслугБанка</name>
  <enumValues>
    <name>ОплатаЧастями</name>
  </enumValues>
  <enumValues>
    <name>МгновеннаяРассрочка</name>
  </enumValues>
  <enumValues>
    <name>Кредит</name>
  </enumValues>
  <enumValues>
    <name>ПакетМалыша</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/УслугиБанка/ObjectModule.bsl
#Область ОбработчикиОсновныхСобытийОбъекта

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда

		Возврат;

	КонецЕсли;

	Если НЕ ЭтоГруппа Тогда

		Если ПустаяСтрока(Наименование) Тогда

			Наименование = СокрЛП(ТипУслуги) + ?(ПериодПредоставления = 0, "", " на " + СокрЛП(ПериодПредоставления) + " мес.");

		КонецЕсли;

		Если ПометкаУдаления И НЕ Блокирован Тогда

			Блокирован = Истина;

		КонецЕсли;

		Если ТипУслуги = Перечисления.ТипыУслугБанка.МгновеннаяРассрочка Тогда

			ПериодПредоставления = 0;
			Эквайрер = Неопределено;

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда

		Возврат;

	КонецЕсли;


КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда

		ДанныеЗаполнения.Свойство("ТипУслуги", ТипУслуги);

	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если ТипУслуги = Перечисления.ТипыУслугБанка.МгновеннаяРассрочка ИЛИ ТипУслуги = Перечисления.ТипыУслугБанка.ПакетМалыша Тогда

		МассивНепроверяемыхРеквизитов = Новый Массив;
		МассивНепроверяемыхРеквизитов.Добавить("ПериодПредоставления");
		МассивНепроверяемыхРеквизитов.Добавить("Эквайрер");
		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);

	КонецЕсли;

КонецПроцедуры
	
#КонецОбласти
